# EX3: Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [53]:
import pandas as pd
import numpy as np

### Step 2. 
User ***Jupyter Lab*** to view ``../../DATA/US_Baby_Names_right.csv'``.

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('../../DATA/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop(columns = ["Unnamed: 0","Id"])

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Are there more male or female names in the dataset?

In [5]:
baby_names["Gender"].value_counts().iloc[[0]]

F    558846
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [6]:
names = baby_names.groupby("Name")

### Step 8. How many different names exist in the dataset?

In [7]:
#baby_names["Name"].nunique()

In [11]:
names.count().shape[0]

17632

### Step 9. What is the name with most occurrences?

In [12]:
names.count().sort_values("Count").tail(1)

       Unnamed: 0    Id  Year  Gender  State  Count
Name
Riley        1112  1112  1112    1112   1112   1112

### Step 10. How many different names have the least occurrences?

In [67]:
names.filter(lambda x: len(x) == 1).shape[0] 
#Note: Not quite sure how to solve without lambda
#Would like to write a command wich filter to the "Count"-Values (names.count() == 1) or sth like this

3682

### Step 11. What is the median name occurrence?

In [77]:
names.count().sort_values("Count").median()

Unnamed: 0    8.0
Id            8.0
Year          8.0
Gender        8.0
State         8.0
Count         8.0
dtype: float64

### Step 12. What is the standard deviation of names?

In [78]:
names.count().sort_values("Count").std()

Unnamed: 0    122.029964
Id            122.029964
Year          122.029964
Gender        122.029964
State         122.029964
Count         122.029964
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [87]:
names.count().agg([np.min,np.max,np.std,np.quantile])

,Unnamed: 0,Id,Year,Gender,State,Count
amin,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
amax,1112.000000,1112.000000,1112.000000,1112.000000,1112.000000,1112.000000
std,122.029964,122.029964,122.029964,122.029964,122.029964,122.029964